keyboard_story.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Keyboard Story</title>
<!-- 2017-07-19 Wed 15:35 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="yury" />
<link rel="stylesheet" type="text/css" href="style.css">
</head>
<body>
<div id="content">
<h1 class="title">Keyboard Story</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Французский батон</a></li>
<li><a href="#sec-2">2. Ситуация на флангах</a></li>
<li><a href="#sec-3">3. Аккорды</a></li>
<li><a href="#sec-4">4. Рокировки по левому борту</a></li>
<li><a href="#sec-5">5. Сквозь игольное ушко</a></li>
<li><a href="#sec-6">6. Системы привязки</a></li>
<li><a href="#sec-7">7. Археология</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Французский батон</h2>
<div class="outline-text-2" id="text-1">
<p>
Посмотрим, чем отличаются клавиатуры друг от друга.
Понятно, что дополнительные панели (цифровая, стрелки и др.) обычно отсутствуют как отдельные панели в варианте клавиатур для ноутбуков.
Давайте рассмотрим подробнее основную панель.
Три ряда символьных клавиш присутствуют в любой модели, 
эти клавиши имеют квадратную форму одинакового размера. Можно сказать, что они составляют ядро клавиатуры.
Если присмотреться, основные отличия в моделях происходят на окраинах.
"Длинные" клавиши - пробел (Space, Enter, Backspace, Shift, CapsLock, Tab&#x2026; - потенциальный источник изменений. 
Их можно делить или, наоборот, соединять с соседними.
Особенно нестабилен нижний ряд. 
За счет пробела можно создать новые клавиши, как справа, так и слева.
"Нарезка" справа позволяет переместить клавиши-стрелки на основную панель.
Клавиша "Enter" - единственная клавиша с замысловатой формой - может её менять,
также позволяя "выделить" место под дополнительные клавиши.             
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Ситуация на флангах</h2>
<div class="outline-text-2" id="text-2">
<p>
Множество горячих клавиш расположилось на левом фланге - 'z','x','c','v','s','q','a','e' - 
для левой руки. Клавиши под простые, но часто производимые действия,
а именно для перемещения/(перемещения с действием) - на правом.
Это Enter, Backspace, Delete, стрелки.
</p>
<ul class="org-ul">
<li>замечание: интересно, что случается при использовании раскладки "Dworak"? Горячие клавиши привязаны к ПО их использующему, а не к ОС, поэтому они могут разбегаться по клавиатуре. 
</li>
<li>замечание: способы перемещения. В Vim - клавиши "h,j,k,l" или "g-j, g-k" (исторические причины, раньше стрелок не было; археология). В Emacs использующиеся сочетания с "ctrl" разбросаны по клавиатуре "С-b, C-n, C-p, C-f", являются начальными буквами соответствующих действий (back, next, previous,forward), что хорошо для начального запоминания, но не оптимально в дальнейшем (см. системы привязки). Также есть игровые раскладки стрелок: "a,w,s,d". 
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Аккорды</h2>
<div class="outline-text-2" id="text-3">
<p>
Если начать прикидывать, какие сочетания клавиш удобнее всего использовать (см. ниже), 
быстро приходишь к выводу, что расположение клавиш на <a href="https://en.wikipedia.org/wiki/Maltron">Мaltron Keyboard</a>, <a href="https://www.amazon.com/Maxi-Aids-Maltron-Keyboards-Dual-Handed/dp/B00IIP3FVA">Amazon</a> именно то, что нужно.
Однако, такая форма клавиатуры, являясь удобной для набора, является не удобной для транспортировки/хранения/размещения.
То есть не является эргономичной в широком смысле.   
Рассмотрим сочетания клавиш: 
</p>
<ul class="org-ul">
<li>полный аккорд "Alt-d-w-q-Shift"/(1,2,3,4,5) &lt;- номера пальцев
</li>
<li>"Alt-q", "Alt-1" /(1,2)
</li>
<li>"Ctrl-q" /(1,2)
</li>
<li>"Сtrl-q" /(3,5) - не рекомендуется, ведёт к <a href="http://ergoemacs.org/emacs/emacs_pinky.html">Pinky Problem</a>  
</li>
<li>На первый взгляд комбинации "Alt+F2"/(1,2) или "Esc+Tab"/(1,2) удобны. Однако, они требуют переноса основания ладони, от места ее обычного размещения при наборе.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Рокировки по левому борту</h2>
<div class="outline-text-2" id="text-4">
<p>
Клавиша "CapsLock" довольно бестолковая, а "Esc" расположена достаточно далеко, что
не идеально при использовании Vim (исторические причины; археология)
Поэтому предлагают делать рокеровку "Esc" и "Tab".
Также есть другие <a href="http://vim.wikia.com/wiki/Avoid_the_escape_key">методы переопределения</a>
Второй вариант рокеровки - "в длинную сторону": "Ctrl" и "Tab". 
Клавиша "Tab" расположена удобнее, также рекоммендуется для устранения Pinky Problem.   
</p>
<ul class="org-ul">
<li>замечание: сочетание Shift-Tab называется inverse Tab.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Сквозь игольное ушко</h2>
<div class="outline-text-2" id="text-5">
<p>
Клавиатура дает нам еще один пример разделения "политики" и "механизма".
Контроллер формирует скан-коды, значение которых могут произвольно трактоваться операционной системой.
</p>
<ul class="org-ul">
<li>с помощью <a href="http://citforum.ru/operating_systems/freebsd/keyboard.shtml">клавиши Compose</a> (пример на FreeBSD) и цифровой панели можно получить любой код символа. Тем самым, оставлена возможность контроля за системой при ошибках настройки.  
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Системы привязки</h2>
<div class="outline-text-2" id="text-6">
<p>
Различные binding systems
</p>
<ul class="org-ul">
<li>система ввода Vim 
</li>
<li><a href="http://ergoemacs.org/emacs/ergonomic_emacs_keybinding.html">эргономичная раскладка Emacs</a>, в частности для исключения <a href="https://www.emacswiki.org/emacs/RepeatedStrainInjury">Repeated Strain Injury</a>  
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Археология</h2>
<div class="outline-text-2" id="text-7">
<p>
История раскладок, добавление дополнительных панелей, первоначальные назначения клавиш. Обозначения.
</p>
<ul class="org-ul">
<li>замечание: тут можно сделать обзор клавишных обозначений, обозначений Emacs, в частности Meta.   
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: yury</p>
<p class="date">Created: 2017-07-19 Wed 15:35</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
